app/controllers/api/v1/mobiles_controller.rb

SELECT "mobiles".* FROM "mobiles"
---
    def index
      @mobiles = Mobile.all

INSERT INTO "mobiles" ("model", "brand", "price", "spec", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["model", "fb"], ["brand", "moto"], ["price", 0], ["spec", "Best Performance"], ["created_at", "2024-01-18 06:08:34.126033"], ["updated_at", "2024-01-18 06:08:34.126033"]]
---
    def create
      permitted_params = params.require(:mobile).permit(:model, :brand, :price, :spec)
      @mobile = Mobile.new(permitted_params)

      if @mobile.save

SELECT "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = $1 LIMIT $2  [["id", 266], ["LIMIT", 1]]
UPDATE "mobiles" SET "price" = $1, "updated_at" = $2 WHERE "mobiles"."id" = $3  [["price", 2500], ["updated_at", "2024-01-18 06:08:41.858961"], ["id", 266]]
---
    def update
      @mobile = Mobile.find(params[:id])

        if @mobile.update(mobile_params)

SELECT "mobiles".* FROM "mobiles" WHERE "mobiles"."id" = $1 LIMIT $2  [["id", 266], ["LIMIT", 1]]
DELETE FROM "mobiles" WHERE "mobiles"."id" = $1  [["id", 266]]
---
      def destroy
        @mobile = Mobile.find(params[:id])

        if @mobile.destroy